app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "?"], ["description", "????"], ["created_at", "2021-04-16 05:40:47.686967"], ["updated_at", "2021-04-16 05:40:47.686967"]]
---
  def create
    @category = Category.create(category_params)