app/controllers/category_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "animal"], ["description", "everything in the forest"], ["updated_at", "2021-03-24 19:43:45.538184"], ["id", 2]]
---
  def update
    @category = Category.find(params[:id])
    @category.update(category_params)