app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.all
    @products = @products.page(params[:page]).per(10)

INSERT INTO "products" ("title", "description", "stock", "price", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "k"], ["description", "l"], ["stock", 1], ["price", 1], ["created_at", "2021-04-16 06:02:52.400458"], ["updated_at", "2021-04-16 06:02:52.400458"], ["status", 1]]
UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2021-04-09 18:27:00.226148"], ["id", 51]]
INSERT INTO "products" ("title", "description", "stock", "price", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "new"], ["description", "asdf"], ["stock", 1], ["price", 1], ["created_at", "2021-03-30 17:05:53.490782"], ["updated_at", "2021-03-30 17:05:53.490782"], ["status", 1]]
---
  def create
    @product = Product.create(product_params)
    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
UPDATE "products" SET "updated_at" = ?, "status" = ? WHERE "products"."id" = ?  [["updated_at", "2021-03-30 17:21:42.508711"], ["status", 1], ["id", 49]]
---
  def update
    @product = Product.find(params[:id])
    puts @product.status
    puts product_params
    respond_to do |format|
      if @product.update(product_params)

INSERT INTO "products" ("title", "description", "stock", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "goods"], ["description", "from no where"], ["stock", 1], ["price", 1], ["created_at", "2021-04-16 06:05:13.173882"], ["updated_at", "2021-04-16 06:05:13.173882"]]
SELECT "categories"."id" FROM "categories" WHERE "categories"."name" = ?  [["name", "stationary"]]
SELECT 1 AS one FROM "categories" WHERE "categories"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "categories" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-04-16 06:05:13.181746"], ["updated_at", "2021-04-16 06:05:13.181746"]]
INSERT INTO "products" ("title", "description", "stock", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "pen"], ["description", "magic ink"], ["stock", 1], ["price", 10], ["created_at", "2021-03-30 17:00:44.134072"], ["updated_at", "2021-03-30 17:00:44.134072"]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "bark"], ["created_at", "2021-03-30 17:05:23.944453"], ["updated_at", "2021-03-30 17:05:23.944453"]]
---
  def csv_upload
    data = params[:csv_file].read.split("\n")
    data.each do |line|
      attr = line.split(",").map(&:strip)
      p = Product.create title: attr[0], description: attr[1], stock: attr[2], price: attr[3]
      unless Category.exists?(name: attr[4])
        Category.create name: attr[4]
      end
      c = Category.where(name: attr[4])
      p.categories << c