app/views/products/_form.html.erb

    <label for="category">Choose category</label>
    <%= form.collection_check_boxes :category_ids, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"