app/views/products/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = ?  [["product_id", 52]]
---
        <td>
          <% if product.categories.present? %>

SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = ?  [["product_id", 1]]
---
        </td>
        <!--                <td><%#= product.categories&.map(&:name)&.join(',').presence || 'NA' %></td>-->